In [1]:
import pandas as pd

* series     ---- 1d array
* data frame ---- 2d array (Table format , row and col)

In [2]:
a = pd.Series([])
b = pd.Series([1,2,33,47,58,100])
c = pd.Series((45,89,20,30,44))
d = pd.Series({'a':10 , 'b':15, 'c':56, 'd':99})

C:\Users\user\AppData\Local\Temp\ipykernel_972\798424801.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  a = pd.Series([])

In [3]:
import numpy as np

In [4]:
n = np.array([1,2,3,4,4])

In [5]:
s = pd.Series([12,45,[45,47],48], index = list('qwer'))

In [6]:
print(s)

q          12
w          45
e    [45, 47]
r          48
dtype: object

In [7]:
s

q          12
w          45
e    [45, 47]
r          48
dtype: object

In [8]:
s1 = pd.Series([12,34,45,56,44], index = ['s','w','e','q','u'])

In [9]:
s1

s    12
w    34
e    45
q    56
u    44
dtype: int64

In [10]:
s2 = pd.Series([12,34,56,34,123,67,34,67,34])

In [11]:
s2

0     12
1     34
2     56
3     34
4    123
5     67
6     34
7     67
8     34
dtype: int64

In [12]:
s2.value_counts()

34     4
67     2
12     1
56     1
123    1
dtype: int64

In [13]:
s2.max()

123

In [14]:
s2.min()

12

In [15]:
s2.argmax()

4

In [16]:
s2.idxmax()

4

In [17]:
s1.idxmax()

'q'

data frame

# DATA FRAME

In [18]:
a = pd.DataFrame()
b = pd.DataFrame([1,2,3,4,5])

In [19]:
a

Empty DataFrame
Columns: []
Index: []

In [20]:
b

   0
0  1
1  2
2  3
3  4
4  5

In [21]:
type(b)

pandas.core.frame.DataFrame

In [22]:
c = pd.DataFrame([[1,2,3],[11,22,33],[111,222,333],[1,2,2],[35,6,23],[23,56,23]])

In [23]:
c

     0    1    2
0    1    2    3
1   11   22   33
2  111  222  333
3    1    2    2
4   35    6   23
5   23   56   23

In [24]:
c.tail()

     0    1    2
1   11   22   33
2  111  222  333
3    1    2    2
4   35    6   23
5   23   56   23

In [25]:
c.head()

     0    1    2
0    1    2    3
1   11   22   33
2  111  222  333
3    1    2    2
4   35    6   23

In [26]:
c.sample(5)

     0    1    2
1   11   22   33
5   23   56   23
3    1    2    2
2  111  222  333
4   35    6   23

In [27]:
c.sample(3)

    0  1   2
4  35  6  23
3   1  2   2
0   1  2   3

In [28]:
c = pd.DataFrame([[1,2,3],[11,22,33],[111,222,333],[1,2,2],[35,6,'missing'],[23,np.nan]],columns = ['a','b','c'])

In [29]:
c

     a      b        c
0    1    2.0        3
1   11   22.0       33
2  111  222.0      333
3    1    2.0        2
4   35    6.0  missing
5   23    NaN     None

In [30]:
c[0:3]

     a      b    c
0    1    2.0    3
1   11   22.0   33
2  111  222.0  333

In [31]:
c[0:3][['b','c']]

       b    c
0    2.0    3
1   22.0   33
2  222.0  333

In [32]:
c.shape

(6, 3)

In [33]:
c.a.max()

111

In [34]:
c['d'] = [12,234,4,34,56,56]

In [35]:
c

     a      b        c    d
0    1    2.0        3   12
1   11   22.0       33  234
2  111  222.0      333    4
3    1    2.0        2   34
4   35    6.0  missing   56
5   23    NaN     None   56